# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.
# Input: 3 4(ввод на разных строках)
# Output: 6

# i = 3
# j = 4
# if i == j:
#       print("Задача не решаема")
# else:
#       print(f"Количество вагонов: {i + j -1}")

headNum = int(input("Введите номер вагона от головы поезда: "))
trainCarNum = int(input("Введите номер вагона: "))
if headNum == trainCarNum:
    print("решений нет")
else:
    print(f"В вашем поезде {headNum + trainCarNum - 1} вагонов")
